{
  "date": "2025-11-08",
  "count": 69,
  "data": {
    "Multiple explosions shake mosque at Indonesian high school injuring at least 55": null,
    "Flares, smoke and clashes disrupt Israeli orchestra’s Paris concert": null,
    "Savage beatings and dying trees: How West Bank settler violence is impacting Palestinians’ olive harvest": null,
    "Sudan’s bloody conflict is plagued by foreign influence – here is what we know": null,
    "Russian Foreign Minister Sergey Lavrov’s absence sets off alarm bells in Moscow": "https://www.reddit.com/r/FreedomofRussia/comments/1oqw1kz/russian_foreign_minister_sergey_lavrovs_absence/",
    "Prince Harry offers jokey apology to Canada for Dodgers baseball cap faux pas": null,
    "Weapons cache believed linked to Hamas found in Vienna by Austria’s intelligence service": null,
    "Canadian court dismisses farm’s attempt to save ostrich flock despite efforts by RFK Jr.": "https://www.reddit.com/r/Ostriches/comments/1oq7cwt/canadian_court_dismisses_farms_attempt_to_save/",
    "Democrats on US congressional panel request interview with former Prince Andrew on Epstein links": "https://www.reddit.com/r/TheWorldDaily/",
    "You’ll never guess the Louvre’s onetime CCTV password. (You absolutely will)": null,
    "Six months in, Pope Leo is bringing an American flavor to the papacy": null,
    "Widespread power outages hit Ukraine after Russian missile and drone barrage": null,
    "Russian forces are poised to finally capture Pokrovsk, a symbolically important victory with a heavy cost": null,
    "Typhoon Fung-wong nears super strength, menacing an already storm-stricken Philippines": null,
    "Israel identifies deceased hostage from Gaza following fourth such transfer this week": null,
    "Typhoon Kalmaegi slams into Vietnam after unleashing deadly destruction in the Philippines": null,
    "‘Professional marksmen’ kill flu-exposed ostrich herd in Canada, ending legal saga that attracted RFK Jr.’s attention": null,
    "Former military lawyer calls U.S. boat strikes ‘murder’3:18": null,
    "After losing legs in war, Russian veteran pulls a 58-ton yacht2:20": null,
    "My Drive with Falana3:56": null,
    "Robot or human? Chinese humanoid causes online stir1:20": null,
    "Satellite images show dramatic growth of China’s military production sites3:14": null,
    "China’s most advanced aircraft carrier enters service2:11": null,
    "Putin considers nuclear testing prep2:23": null,
    "No Blue, No Green: A conversation with Sylvia Earle23:01": null,
    "Russia says new nuclear weapons are of ‘historic significance’1:55": null,
    "Marine biologist: “Everything we do from when we get up in the morning to when we go to bed connects us to coral reefs.”2:00": "https://www.reddit.com/r/science/comments/3a9x96/science_ama_series_hello_reddit_im_barbara/",
    "VideoPutin considers nuclear testing prep2:23": null,
    "VideoOver 100 killed by Typhoon Kalmaegi in the Philippines0:37": null,
    "VideoGlobal Perspectives: Can tourism and conservation align?12:09": null,
    "VideoGlobal Perspectives: Generation transformation30:01": null,
    "Trump grants Hungary one-year exemption from Russian energy sanctions, White House says": "https://www.reddit.com/r/UkrainianConflict/comments/1orfvq7/trump_grants_hungary_oneyear_exemption_from/",
    "Russian soldier jailed for life after being found guilty of shooting dead Ukrainian PoW, in unprecedented ruling": "https://www.reddit.com/r/ukraine/comments/1oqsh2s/russian_soldier_jailed_for_life_after_being_found/",
    "German nurse convicted of murdering 10 patients to reduce his workload": "https://www.reddit.com/r/Health/comments/1oq4fzv/german_nurse_convicted_of_murdering_10_patients/",
    "Car ramming injures 10 people on French island, interior minister says": null,
    "Turkey issues ‘genocide’ arrest warrants against Netanyahu and other Israeli officials": "https://www.reddit.com/r/nottheonion/comments/1orft6y/turkey_issues_genocide_arrest_warrants_against/",
    "Israeli military launches strikes across southern Lebanon against what it says are Hezbollah targets": null,
    "Israel says hostage body returned from Gaza belongs to Tanzanian student as it probes fate of longest-held captive": null,
    "Newly freed Israeli hostage says he was sexually assaulted in captivity": "https://www.reddit.com/r/Israel_Palestine/comments/1opk8ur/newly_freed_israeli_hostage_says_he_was_sexually/",
    "Hostage remains handed over Tuesday are those of dual US-Israeli citizen Itay Chen, Israel says": null,
    "Dick Cheney helped design the ‘war on terror.’ It opened a Pandora’s box that still hasn’t been closed": null,
    "GalleryPeople we’ve lost in 2025": null,
    "GalleryThe week in 39 photos": null,
    "GalleryThis week in 30 photos": null,
    "How traffickers deep in the Sahara are extorting ransom payments from refugees’ families": null,
    "South Africa to probe recruitment of citizens as mercenaries in Russia-Ukraine conflict": null,
    "UN secretary-general warns that war in Sudan is ‘spiraling out of control’": null,
    "Tattoo artist draws on deep connections to ancient Nigerian art forms": null,
    "Elite Iranian unit plotted assassination of Israeli ambassador to Mexico, US official says": "https://www.reddit.com/r/Global_News_Hub/comments/1or8gw8/elite_iranian_unit_plotted_assassination_of/",
    "‘No one can shut our voice’: Miss Universe Mexico confronts mistreatment": null,
    "Spain dismantles its first suspected cell of Tren de Aragua, Venezuelan gang targeted by Trump": "https://www.reddit.com/r/worldnews/comments/1or9rcn/spain_dismantles_its_first_suspected_cell_of_tren/",
    "Mexico’s President Sheinbaum takes legal action after groping incident": "https://www.reddit.com/r/internationalpolitics/comments/1ophqyo/mexicos_president_sheinbaum_takes_legal_action/",
    "Rare footage shows sucker fish as they whale-surf in the ocean’s wildest joyride": null,
    "Facing a spike in deadly bear attacks, Japan turns to the military and drones that bark": "https://www.reddit.com/r/duolingojapanese/comments/1opxd6v/umm_excuse_mee/",
    "Malaysian court rules police and government responsible for pastor and activist abduction": null,
    "Typhoon Kalmaegi kills at least 85 in the Philippines, heads toward Vietnam": null,
    "Qantas releases first images of jet that will fly nonstop from Sydney to London and New York": "https://www.reddit.com/r/TheWorldDaily/comments/1or2yt3/qantas_releases_first_images_of_jet_that_will_fly/",
    "Travel troubles? We want to hear from you": null,
    "Germans think their bread is the best in the world. Here’s why they might be right": null,
    "The world’s best hotel for 2025 is a waterfront skyscraper": null,
    "Is the AirTag the best luggage tracker? Here’s what I think after testing 13 competitors": null,
    "The ‘D-Day watches’ made from WWII helmets — and beach sand from Normandy": null,
    "The sculptural lighting designer handcrafting $90,000 chandeliers": null,
    "Rising ‘Black Star’ singer Amaarae takes center stage": "https://www.reddit.com/r/popheads/comments/1lfwo28/amaarae_announces_new_album_black_star_out_august/",
    "Look of the Week: The humble sequin dress is fashion’s great equalizer": null,
    "How much would you pay for an infamous gold toilet?": "https://www.reddit.com/user/AddictedArtGallery/comments/1or4bj8/how_much_would_you_pay_for_an_infamous_gold_toilet/",
    "Deep freeze to cause major temperature swings, with lows that could break records in the South": null,
    "Melissa was one of the strongest storms on record. NOAA’s Hurricane Hunters flew into it without pay": null,
    "Cuba is staring down a direct hit from Melissa. Here’s what to expect": null
  }
}