{
  "date": "2025-11-13",
  "count": 89,
  "data": {
    "‘A death sentence for my son’: Israel plans to deport sick Palestinians back to Gaza, patients and doctors say": null,
    "Kazakhstan follows Russia in banning ‘LGBTQ propaganda’": "https://www.reddit.com/r/Global_News_Hub/comments/1ovau7a/kazakhstan_follows_russia_in_banning_lgbtq/",
    "Rumors swirl of a plot to oust Keir Starmer as the embattled British leader denies attacking his rivals": null,
    "Why is Trump threatening to sue the BBC for $1 billion?": "https://www.reddit.com/discover/melania-trump-threatens-to-sue-hunter-biden/?q=melania+trump+threatens+to+sue+hunter+biden&source=trending",
    "How drones and AI are protecting the Brazilian rainforest": null,
    "Trump pens letter asking Israeli president to pardon Netanyahu in corruption trial": null,
    "Chinese ‘cryptoqueen’ who had royal aspirations jailed in UK over $6.6 billion Bitcoin scam": null,
    "Venezuela announces ‘massive mobilization’ of military forces as America’s largest warship sails into region": "https://www.reddit.com/r/politics/comments/1ouw6v6/venezuela_announces_massive_mobilization_of/",
    "Serbian protesters vow to prevent real estate project linked to Trump son-in-law Kushner": "https://www.reddit.com/r/politics/comments/1oudxj5/serbian_protesters_vow_to_prevent_real_estate/",
    "At least 12 killed in Islamabad suicide attack – the most deadly assault in the Pakistani capital since 2008": null,
    "India on edge after deadly car explosion in capital region. Here’s what we know": null,
    "British journalist Sami Hamdi expected to be released from ICE detention and return to UK": "https://www.reddit.com/r/europe/comments/1otu969/british_journalist_sami_hamdi_expected_to_be/",
    "Amid tensions with US, high inflation is back on Venezuela’s streets": null,
    "At least 27 inmates killed by ‘asphyxiation’ in southern Ecuador in wave of prison violence": "https://www.reddit.com/r/Full_news/comments/1ottsx8/at_least_27_inmates_killed_by_asphyxiation_in/",
    "Former French President Nicolas Sarkozy released from prison pending appeal": "https://www.reddit.com/r/LegalNews/comments/1otzpld/former_french_president_nicolas_sarkozy_released/",
    "Kremlin warns of ‘dangerous’ nuclear rhetoric1:18": null,
    "Saudi developer to open new luxury tourist destination6:33": null,
    "Indigenous protesters clash with COP30 security0:47": null,
    "Search continues for Rohingya refugees after boat capsizes1:00": null,
    "Video: Israeli settlers launch arson attack in occupied West Bank0:51": null,
    "UK cuts some intel to US over deadly boat strikes0:33": null,
    "Footage shows Russian troops approaching key Ukrainian city of Pokrovsk1:04": null,
    "Cristiano Ronaldo says 2026 World Cup will be his last7:30": null,
    "Israeli parliament advances two controversial bills2:57": null,
    "‘It’s scary that she’s on the doorstep of freedom.’ Virginia Giuffre’s family reacts to new reports about Ghislaine Maxwell.3:07": null,
    "VideoVideo shows suspected suicide attack in Pakistan0:25": null,
    "Video‘Volnado’ spotted near Hawaii’s Kilauea volcanic eruption0:15": null,
    "VideoUruguay facing growing threat from organized crime3:58": null,
    "VideoFormer French President Nicolas Sarkozy to be released from prison pending appeal1:38": null,
    "BBC leaders resign amid scandal over misleading edit of Trump speech": "https://www.reddit.com/r/news/comments/1osvyif/bbc_director_resigns_over_editing_of_trump_speech/",
    "Millions of Ukrainians face dark and cold after one of Russia’s largest attacks on energy infrastructure": "https://www.reddit.com/r/EndlessWar/comments/1ot7w74/millions_of_ukrainians_face_dark_and_cold_after/",
    "Syrian migrants in Germany face uncertain future as government floats repatriation": "https://www.reddit.com/r/tomorrowsworld/comments/1ot2jb8/syrian_migrants_in_germany_face_uncertain_future/",
    "UK and Germany have accused Russia of threatening their satellites. Here’s what that means": "https://www.reddit.com/r/politics/comments/1osuylj/uk_and_germany_have_accused_russia_of_threatening/",
    "Nuclear codes, voicemail hacks and businesses going bust. These are some of the biggest password blunders": "https://www.reddit.com/r/technology/comments/1oujwfi/nuclear_codes_voicemail_hacks_and_businesses/",
    "Pope Leo holds hours-long ‘profound and painful’ meeting with abuse survivors": "https://www.reddit.com/r/exmormon/comments/1osn3qy/will_we_ever_see_upper_lds_leadership_do/",
    "Dozens of Israeli settlers launch arson attack in West Bank as attacks against Palestinians surge": "https://www.reddit.com/r/nyt/",
    "Syria’s jihadist-turned-president caps extraordinary transformation with White House visit": null,
    "Turkish prosecutor seeks 2,000 years for jailed opposition mayor of Istanbul": "https://www.reddit.com/r/worldnews/comments/1oultpv/turkish_prosecutor_seeks_2000_years_for_jailed/",
    "Controversial death penalty and foreign media bills clear first reading in Israel’s parliament": null,
    "Hannibal Gadhafi, son of late Libyan leader Moammar, released by Lebanon after 10 years in detention": null,
    "Israel confirms returned body belongs to soldier killed in Gaza in 2014 war": null,
    "GalleryPeople we’ve lost in 2025": null,
    "GalleryThe week in 39 photos": null,
    "GalleryThis week in 30 photos": null,
    "Sudan’s bloody conflict is plagued by foreign influence – here is what we know": null,
    "How traffickers deep in the Sahara are extorting ransom payments from refugees’ families": null,
    "South Africa to probe recruitment of citizens as mercenaries in Russia-Ukraine conflict": null,
    "UN secretary-general warns that war in Sudan is ‘spiraling out of control’": null,
    "Protesters force their way into COP30 summit venue, clash with security": null,
    "Dozens of Venezuelans deported from US to notorious Salvadoran prison subjected to torture, rights groups claim in new report": null,
    "Behind Rio’s deadly raid: Brazil’s billion-dollar criminal networks": null,
    "‘Unprecedented’ tornado tears through southern Brazil, killing at least six": null,
    "How Japan’s new prime minister has brought China’s ‘wolf warriors’ back out": null,
    "Two blasts a day apart in India and Pakistan’s capitals fray regional nerves in an already tense year": null,
    "Thailand ‘halts’ peace agreement with Cambodia hailed by Trump after landmine explosion injures troops": null,
    "He was a US-backed dictator who led sweeping massacres. Why is he now being named a national hero?": null,
    "What’s happening with Thanksgiving flights? Here’s what to know": null,
    "Mount Nemrut: Where colossal stone gods guard a 2,000-year-old mystery": null,
    "Growing grapes in the desert: This award-winning wine is made in one of the world’s harshest climates": null,
    "Pressure grows for release of penguins ‘trapped’ at London aquarium": null,
    "Forget Christmas. In Sicily, they’re already thinking of Easter": null,
    "Look of the Week: Joe Jonas and the rise of the casual tie": null,
    "Unseen images revealed from the archive of Nigerian photography legend J.D. Ojeikere": null,
    "Klimt portrait in late Estée Lauder heir’s collection could fetch over $150 million at auction": null,
    "Writer David Szalay wins prestigious Booker Prize for fiction with his earthy novel ‘Flesh’": null,
    "Louvre ‘fedora man’ revealed: Meet the stylish teen dresser snapped at scene of heist": null,
    "Northern lights just dazzled night skies as far south as Florida. Here’s who has the best chance to see them tonight": null,
    "Record-breaking cold settles in across the southern US, but another big change is coming": null,
    "Deep freeze to cause major temperature swings, with lows that could break records in the South": null,
    "Near dozen dead in Thai-Malaysia search after Rohingya migrant boat sinks": null,
    "Trump’s trade war is pushing Canada closer to China": null,
    "Trump’s Thailand-Cambodia peace agreement is falling apart after Cambodian villager killed in fresh clashes": null,
    "Pakistan parliament approves more powers for army chief, curbs top court": null,
    "Venezuelans voice uncertainty, fear and skepticism after arrival of US aircraft carrier in region": null,
    "British Police want to speak to a MAGA influencer and partner after London incident": null,
    "Two of China’s most popular gay dating apps have disappeared from app stores": null,
    "After festival of lights, New Delhi plunged into toxic darkness and world’s most polluted air": null,
    "Typhoon reveals centuries old shipwreck in Vietnam0:35": null,
    "Disturbing aftermath of Israeli settler rampage2:36": null,
    "VideoIsraeli parliament advances two controversial bills2:57": null,
    "Video‘It’s scary that she’s on the doorstep of freedom.’ Virginia Giuffre’s family reacts to new reports about Ghislaine Maxwell.3:07": null,
    "More than 1.4 million evacuated as second typhoon in a week slams into the Philippines": null,
    "British journalist Sami Hamdi headed home after more than two weeks in ICE detention": null,
    "Malian TikToker killed by suspected jihadists after pro-army posts": "https://www.reddit.com/r/AfricaVoice/comments/1ou8wsb/malian_tiktoker_killed_by_suspected_jihadists/",
    "Dominic Thomas: ‘The risk to Keir Starmer’s future is from within’2:51": null,
    "VideoCristiano Ronaldo says 2026 World Cup will be his last7:30": null,
    "Mexico’s female rodeo culture has been challenging gender norms for decades. But the job isn’t done": null,
    "Israel identifies deceased hostage from Gaza following fourth such transfer this week": null,
    "Turkey issues ‘genocide’ arrest warrants against Netanyahu and other Israeli officials": null
  }
}